Revit 2027 API
CurtainGrid.Grid1Offset Property
The offset for the U grid line pattern of the curtain grid.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Grid1Offset { get; set; }
Public Property Grid1Offset As Double
	Get
	Set
public:
property double Grid1Offset {
	double get ();
	void set (double value);
}
member Grid1Offset : float with get, set
Property Value
Double
See Also
Reference
CurtainGrid Class
Autodesk.Revit.DB Namespace